{"class_name": "Model", "keras_version": "2.0.8", "config": {"output_layers": [["activation_25", 0, 0]], "input_layers": [["input_69", 0, 0], ["input_70", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_69", "config": {"batch_input_shape": [null, 1223], "name": "input_69", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_70", "config": {"batch_input_shape": [null, 865], "name": "input_70", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Sequential", "name": "sequential_35", "config": [{"class_name": "Embedding", "config": {"output_dim": 64, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "batch_input_shape": [null, null], "input_dim": 83416, "embeddings_constraint": null, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "trainable": true, "name": "embedding_71", "embeddings_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_105", "rate": 0.3, "trainable": true}}], "inbound_nodes": [[["input_69", 0, 0, {}]]]}, {"class_name": "Sequential", "name": "sequential_36", "config": [{"class_name": "Embedding", "config": {"output_dim": 64, "dtype": "float32", "activity_regularizer": null, "mask_zero": false, "batch_input_shape": [null, null], "input_dim": 83416, "embeddings_constraint": null, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "trainable": true, "name": "embedding_72", "embeddings_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_106", "rate": 0.3, "trainable": true}}], "inbound_nodes": [[["input_70", 0, 0, {}]]]}, {"class_name": "Dot", "name": "dot_19", "config": {"name": "dot_19", "axes": [2, 2], "normalize": false, "trainable": true}, "inbound_nodes": [[["sequential_35", 1, 0, {}], ["sequential_36", 1, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_32", "config": {"recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "go_backwards": false, "implementation": 0, "use_bias": true, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "recurrent_regularizer": null, "name": "lstm_32", "return_state": false, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "bias_constraint": null, "trainable": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "units": 32, "return_sequences": false, "bias_regularizer": null, "activation": "tanh"}, "inbound_nodes": [[["dot_19", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_107", "config": {"name": "dropout_107", "rate": 0.3, "trainable": true}, "inbound_nodes": [[["lstm_32", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_22", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activation": "linear", "trainable": true, "name": "dense_22", "units": 1, "bias_regularizer": null}, "inbound_nodes": [[["dropout_107", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_25", "config": {"name": "activation_25", "activation": "sigmoid", "trainable": true}, "inbound_nodes": [[["dense_22", 0, 0, {}]]]}], "name": "model_18"}, "backend": "tensorflow"}